# PointCloudOverrideSettings Constructor (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PointCloudOverrideSettings Constructor
PointCloudOverrideSettings Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| PointCloudOverrideSettings()()()() | Constructs a settings object with default values. |
| PointCloudOverrideSettings(PointCloudOverrideSettings) | Constructs a copy of source object. |

# See Also
PointCloudOverrideSettings Class
PointCloudOverrideSettings Members
Autodesk.Revit.DB.PointClouds Namespace